import { khoeService } from '../../services/khoe/khoe';

describe('LocalRun', () => {
  it(`Run Locally`, async () => {
    const result = await khoeService.getSchedule();
    console.log('scv_result', JSON.stringify(result, null, 2));
    expect(1).toEqual(1);
  });
});

// [
//   {
//     "title": "У Харківській області 8 грудня діятимуть погодинні відключення",
//     "url": "/uk/node/13882922"
//   },
//   {
//     "title": "Споживачі Харківської області встановили абсолютний рекорд із передачі показань",
//     "url": "/uk/node/13882924"
//   },
//   {
//     "title": "У Харківській області введено графіки аварійних відключень",
//     "url": "/uk/node/13882925"
//   },
//   {
//     "title": "У Харківській області 9 грудня діятимуть погодинні відключення",
//     "url": "/uk/node/13882926"
//   },
//   {
//     "title": "У Харківській області введено графіки аварійних відключень",
//     "url": "/uk/node/13882927"
//   },
//   {
//     "title": "Чому важливо не вмикати потужні електроприлади одразу після відновлення електропостачання?",
//     "url": "/uk/node/13882931"
//   },
//   {
//     "title": "У Харківській області 11 грудня діятимуть погодинні відключення",
//     "url": "/uk/node/13882932"
//   },
//   {
//     "title": "У Харківській області 12 грудня діятимуть погодинні відключення",
//     "url": "/uk/node/13882933"
//   },
//   {
//     "title": "У Харківській області 13 грудня діятимуть погодинні відключення",
// У Харківській області 8 грудня діятимуть погодинні відключення
// У Харківській області 9 грудня діятимуть погодинні відключення
// У Харківській області 11 грудня діятимуть погодинні відключення
// У Харківській області 11 грудня діятимуть погодинні відключення
// У Харківській області 12 грудня діятимуть погодинні відключення

// {
//   "title": "У Харківській області 9 грудня діятимуть погодинні відключення",
//     "url": "/uk/node/13882926",
//     "targetDate": {
//   "targetDate": "2025-12-09",
//       "rawDateObj": {
//     "index": 12,
//         "name": "грудня",
//         "year": 2025,
//         "day": 9
//   }
// }
// },
