const yesterday_20 = 1765562513;
const today_8_13 = 1765606433;
const today_14_55 = 1765630553;

export const messages = [
  {
    message: `Через постійні ворожі обстріли та наслідки попередніх масованих ракетно-дронових атак по Черкаській області 13 грудня за командою НЕК «Укренерго» застосовуватимуться графіки погодинних вимкнень (ГПВ).

Години відсутності електропостачання:

1.1 00:00 - 02:00, 04:00 - 06:00, 08:00 - 10:00, 14:00 - 16:00, 20:00 - 22:00

1.2 00:00 - 02:00, 04:00 - 06:00, 08:00 - 10:00, 14:00 - 16:00, 19:00 - 22:00

2.1 00:00 - 02:00, 04:00 - 06:00, 08:00 - 10:00, 12:00 - 14:00, 16:00 - 18:00, 22:00 - 24:00

2.2 00:00 - 02:00, 04:00 - 06:00, 08:00 - 10:00, 12:00 - 14:00, 16:00 - 18:00, 20:00 - 22:00

3.1 02:00 - 04:00, 06:00 - 08:00, 10:00 - 12:00, 14:00 - 16:00, 18:00-20:00, 22:00 - 24:00

3.2 02:00 - 04:00, 10:00 - 12:00, 14:00 - 16:00, 18:00-21:00

4.1 02:00 - 04:00, 06:00 - 08:00, 10:00 - 12:00, 14:00 - 16:00, 18:00-20:00

4.2 02:00 - 04:00, 06:00 - 08:00, 10:00 - 12:00, 14:00 - 16:00, 18:00-20:00

5.1 06:00 - 08:00, 10:00 - 12:00, 16:00 - 19:00, 22:00 - 24:00

5.2 04:00 - 06:00, 08:00 - 10:00, 12:00 - 14:00, 16:00 - 19:00

6.1 02:00 - 04:00, 12:00 - 14:00, 16:00 - 18:00, 20:00 - 22:00

6.2 00:00 - 02:00, 06:00 - 08:00, 12:00 - 14:00, 16:00 - 18:00, 22:00 - 24:00

Перелік адрес, що знеструмлюються по чергах (підчергах) ГПВ можна переглянути за посиланням https://www.cherkasyoblenergo.com/off

 (https://www.cherkasyoblenergo.com/off)Зверніть увагу, ситуація в енергосистемі може змінюватися, тому стежте за нашими оновленнями.

Сторінка у Telegram: t.me/pat_cherkasyoblenergo (https://gita.cherkasyoblenergo.com/obl-main-controller/admin/news/t.me/pat_cherkasyoblenergo)`,
    date: yesterday_20,
  },
  {
    message: `Оновлений графік погодинних вимкнень на 13 грудня за командою НЕК «Укренерго».

Години відсутності електропостачання:

1.1 14:00 - 16:00, 20:00 - 22:00

1.2 14:00 - 16:00, 19:00 - 22:00

2.1 09:00 - 10:00, 12:00 - 14:00, 16:00 - 18:00, 22:00 - 24:00

2.2 12:00 - 14:00, 16:00 - 18:00, 20:00 - 22:00

3.1 10:00 - 12:00, 14:00 - 16:00, 18:00-20:00, 22:00 - 24:00

3.2 10:00 - 12:00, 14:00 - 16:00, 18:00-21:00

4.1 10:00 - 12:00, 14:00 - 16:00, 18:00-20:00

4.2 10:00 - 12:00, 14:00 - 16:00, 18:00-20:00

5.1 10:00 - 12:00, 16:00 - 19:00, 22:00 - 24:00

5.2 08:00 - 10:00, 12:00 - 14:00, 16:00 - 19:00

6.1 12:00 - 14:00, 16:00 - 18:00, 20:00 - 22:00

6.2 12:00 - 14:00, 16:00 - 18:00, 22:00 - 24:00

Перелік адрес, що знеструмлюються по чергах (підчергах) ГПВ можна переглянути за посиланням https://www.cherkasyoblenergo.com/off

 (https://www.cherkasyoblenergo.com/off)Зверніть увагу, ситуація в енергосистемі може змінюватися, тому стежте за нашими оновленнями.

Сторінка у Telegram: t.me/pat_cherkasyoblenergo (https://gita.cherkasyoblenergo.com/obl-main-controller/admin/news/t.me/pat_cherkasyoblenergo)`,
    date: today_8_13,
  },
  {
    message: `Оновлений графік погодинних вимкнень на 13 грудня за командою НЕК «Укренерго».

Години відсутності електропостачання:

1.1 14:00 - 16:00, 20:00 - 22:00

1.2 14:00 - 16:00, 19:00 - 22:00

2.1 15:00 - 18:00, 22:00 - 24:00

2.2 16:00 - 18:00, 20:00 - 22:00

3.1 18:00-20:00, 22:00 - 24:00

3.2 14:00 - 16:00, 18:00-21:00

4.1 18:00-20:00

4.2 14:00 - 16:00, 18:00-20:00

5.1 16:00 - 19:00, 22:00 - 24:00

5.2 16:00 - 19:00

6.1 16:00 - 18:00, 20:00 - 22:00

6.2 16:00 - 18:00, 22:00 - 24:00

Перелік адрес, що знеструмлюються по чергах (підчергах) ГПВ можна переглянути за посиланням https://www.cherkasyoblenergo.com/off

 (https://www.cherkasyoblenergo.com/off)Зверніть увагу, ситуація в енергосистемі може змінюватися, тому стежте за нашими оновленнями.

Сторінка у Telegram: t.me/pat_cherkasyoblenergo (https://gita.cherkasyoblenergo.com/obl-main-controller/admin/news/t.me/pat_cherkasyoblenergo)`,
    date: today_14_55,
  },
];

/** EXPECTED RESULTS */
export const expectedResult = {
  events: [
    {
      date: '2025-12-11',
      electricity: 'off',
      endTime: '05:00',
      provider: 'CHERKOE',
      queue: '6.1',
      startTime: '02:00',
    },
    {
      date: '2025-12-11',
      electricity: 'off',
      endTime: '12:00',
      provider: 'CHERKOE',
      queue: '6.1',
      startTime: '08:00',
    },
    {
      date: '2025-12-11',
      electricity: 'off',
      endTime: '18:00',
      provider: 'CHERKOE',
      queue: '6.1',
      startTime: '14:00',
    },
    {
      date: '2025-12-11',
      electricity: 'off',
      endTime: '24:00',
      provider: 'CHERKOE',
      queue: '6.1',
      startTime: '20:00',
    },
    {
      date: '2025-12-11',
      electricity: 'off',
      endTime: '03:00',
      provider: 'CHERKOE',
      queue: '6.2',
      startTime: '00:00',
    },
    {
      date: '2025-12-11',
      electricity: 'off',
      endTime: '16:00',
      provider: 'CHERKOE',
      queue: '6.2',
      startTime: '12:00',
    },
    {
      date: '2025-12-11',
      electricity: 'off',
      endTime: '22:00',
      provider: 'CHERKOE',
      queue: '6.2',
      startTime: '18:00',
    },
  ],
  hasTodayData: true,
  hasTomorrowData: false,
};
